# Lesson 6
Looking at the groupby function

In [1]:
import pandas as pd
import sys

In [2]:
print("Python version"+sys.version)
print("Pandas version"+pd.__version__)

Python version3.6.3 |Anaconda custom (64-bit)| (default, Nov  8 2017, 18:10:31)
[GCC 4.2.1 Compatible Clang 4.0.1 (tags/RELEASE_401/final)]
Pandas version0.21.0

In [3]:
#Out small data set
d={
    "one":[1,1,1,1,1],
    "two":[2,2,2,2,2],
    "letter":["a","a","b","b","c"]
}

#create dataframe
df=pd.DataFrame(d)
df

  letter  one  two
0      a    1    2
1      a    1    2
2      b    1    2
3      b    1    2
4      c    1    2

In [5]:
#Create group object
one=df.groupby("letter")

one

In [6]:
#Apply sum function
one.sum()

        one  two
letter
a         2    4
b         2    4
c         1    2

In [9]:
one1=df.groupby("one")
one1.sum()

     two
one
1     10

In [10]:
letterone=df.groupby(["letter",'one']).sum()
letterone

            two
letter one
a      1      4
b      1      4
c      1      2

In [12]:
lettertwo=df.groupby(["letter","two"]).sum()
lettertwo

            one
letter two
a      2      2
b      2      2
c      2      1

In [13]:
letterone.index

MultiIndex(levels=[['a', 'b', 'c'], [1]],
           labels=[[0, 1, 2], [0, 0, 0]],
           names=['letter', 'one'])

You may want to not have the columns you are grouping by become your index, this can be easily achieved as shown below.

In [14]:
letterone=df.groupby(["letter","one"],as_index=False).sum()

In [15]:
letterone.index

Int64Index([0, 1, 2], dtype='int64')